"use strict";

// debugger

// написати функцію, яка приймає рядок і повертає кількість голосних в рядку
// регістр не враховувати (рахувати і великі і маленькі голосні)
// працюємо тільки з латинецею
// const vowels = ['a', 'e', 'i', 'u', 'o', 'y'];
// не використовувати регулярні вирази!

// спробувати оптимізувати функцію до одного ретурну (можна функцію-стрілку без ретурну взагалі)
const words = rest => rest.split("").filter(vowels => "aeiuoyAEIUOY".includes(vowels)).length;
 
console.log(words('Live is good and beaUtiful'))